[
    {
        "id": "1",
        "firstName": "Olivier",
        "lastName": "GOY",
        "description": "Passionné depuis toujours de nouvelles technologies et particulièrement d’innovations numériques, j’ai pu acquérir grâce à mes différentes formations des compétences de programmation dans différents langages, aussi bien en front qu’en back, en ayant recours à différents framework. Je consolide par ailleurs toutes ces aptitudes à travers une pratique quotidienne du code.",
        "trainning": "Formé par la WildCodeSchool en 2017, j’ai également suivi la formation d’OpenClassrooms en 2023 afin de me mettre à niveau et de maîtriser au mieux les évolutions des différents langages de programmation. Cette dernière formation, en distanciel, m’a en outre permis de consolider encore davantage les compétences d’organisation et d’autonomie acquises au cours de mes différentes expériences professionnelles. Suite à ma première formation, j’ai notamment eu l’opportunité de faire un stage de 6 mois chez Biagri pour le site compararteuragricole et de contribuer à la mise en place et à la conception de leur site internet en travaillant en frontend sur Angular.",
        "skills": [
            {
                "titleSkill": "Languages",
                "altSkill": "logo code",
                "listSkills": ["Javascript", "Java", "Php", "Html5 - Css3"],
                "logoSkillUrl" : "https://oliviergoy.dev/Images/code.png"
            },
            {
                "titleSkill": "Frameworks",
                "altSkill": "logo framework",
                "listSkills": ["ReactJS", "React Native", "Angular", "ExpressJs"],
                "logoSkillUrl" : "https://oliviergoy.dev/Images/algorithme.png"
            },  
            {
                "titleSkill": "Datas",
                "altSkill": "logo data",
                "listSkills": ["MongoDB", "MySQL"],
                "logoSkillUrl" : "https://oliviergoy.dev/Images/bases-de-donnees.png"
            },
            {
                "titleSkill": "Outils",
                "altSkill": "logo outil",
                "listSkills": ["VSCode - PhpStorm", "Git - GitHub", "Bootstrap - Materialize", "JQuery", "NodeJs", "Brew - Npm", "Trello - Notion", "Postman", "Slack"],
                "logoSkillUrl" : "https://oliviergoy.dev/Images/programmation.png"
            }
        ]
    }
]