[
  {
    "id": "1",
    "title": "BOOKI",
    "descriptionBackground": "Projet d'étude dans le cadre de ma formation OpenClassrooms.",
    "descriptionRealization": "Création d'une page d'accueil pour une agence de voyage en HTML & CSS uniquement. L'intégration de la page à été réalisée en se basant sur une maquette présente sur Figma et comportait une partie responsive pour les formats d'écran desktop, tablette et mobile.",
    "descriptionProblematic": "Intégration complète de la page sur les différents format d'écran (desktop, tablette, portable) par rapport à une maquette sur figma, en utilisant html et css uniquement.",
    "descriptionSolution": "Utilisation des propriétés Flexbox et Grid pour l'intégration des éléments de la page et pour le responsive utilisation des Media Queries",
    "imageUrl": "https://oliviergoy.dev/Images/Booki/Booki.webp",
    "imagesUrl": [
      "https://oliviergoy.dev/Images/Booki/FirstImageBooki.webp",
      "https://oliviergoy.dev/Images/Booki/TwoImageBooki.webp",
      "https://oliviergoy.dev/Images/Booki/ThreeImageBooki.webp",
      
      "https://oliviergoy.dev/Images/Booki/FourImageBooki.webp",
      "https://oliviergoy.dev/Images/Booki/FiveImageBooki.webp",
      "https://oliviergoy.dev/Images/Booki/SixImageBooki.webp"
    ],
    "linkGitHub": "https://github.com/olivier-goy/Goy_Olivier_2_HTML-CSS_02012023/tree/dev",
    "linkWebSite": "https://olivier-goy.github.io/Goy_Olivier_2_HTML-CSS_02012023/",
    "tools": ["HTML", "CSS", "FIGMA", "VSCODE"]
  },
  {
    "id": "2",
    "title": "SOPHIE BLUEL",
    "descriptionBackground": "Projet d'étude dans le cadre de ma formation OpenClassrooms.",
    "descriptionRealization": "Mise en place d'une dynamisation d'un site avec le langage de programmation Javascript et en se basant sur du code déjà existant en Frontend et Backend. Le Projet consistait à donner la possibilité à l'administrateur de se connecter à son compte et de s'en déconnecter en toute sécurité. L'administrateur authentifié devait avoir la possibilité de supprimer des projets de son portefolio mais aussi d'en créer d'autres via un formulaire. Enfin, le visiteur du site devait avoir la possibilité de filtrer les projets présents dans la galerie.",
    "descriptionProblematic": "La dynamisation du site concernait la gestion de la connexion et déconnexion de l'administrateur ainsi que la possibilité d'afficher, créer et supprimer les projets de sa galerie via le backend en utilisant uniquement javascript natif",
    "descriptionSolution": "Utilisation de la méthode fetch dans une promesse pour la gestion des requêtes qui permette la connexion (POST), pour l'affichage des projets (GET), pour la création du projet (POST), et pour la suppression des projets (DELETED)",
    "imageUrl": "https://oliviergoy.dev/Images/SophieBluel/SophieBluel.webp",
    "imagesUrl": ["https://oliviergoy.dev/Images/SophieBluel/TwoSophieBluel.webp"],
    "linkGitHub": "https://github.com/olivier-goy/Portfolio-architecte-sophie-bluel",
    "linkWebSite": "",
    "tools": ["JAVASCRIPT", "HTML", "CSS", "VSCODE", "GIT", "GITHUB"]
  },
  {
    "id": "3",
    "title": "NINA CARDUCCI",
    "descriptionBackground": "Projet d'étude dans le cadre de ma formation OpenClassrooms.",
    "descriptionRealization": "Projet pour lequel il fallait débugger la partie carousel de la galerie qui ne fonctionnait pas ainsi que le changement d'état du filtre. Le deuxième point était l'optimisation en modifiant la taille des images ainsi que leur format qui a été passé en webp. Une grande révision du code a été effectuée pour enlever tous les oublis et corriger les mauvaises pratiques afin d'optimiser le référencement et par la même occasion mettre en place un schema.org. Certains éléments du site ont été modifiés dans le but de pallier le problème d'accessibilité.",
    "descriptionProblematic": "Débugger la partie carousel, optimiser le site, ajouter un référencement local, et améliorer le SEO.",
    "descriptionSolution": "Utilisation de DevTools pour débugger, optimisation des images en taille et format pour améliorer la performence, référencement local avec schéma.org, amélioration du code html en ajoutant les bonnes balises pour le SEO",
    "imageUrl": "https://oliviergoy.dev/Images/NinaCarducci/NinaCarducci.webp",
    "imagesUrl": ["https://oliviergoy.dev/Images/NinaCarducci/OneNinaCarducci.webp", "https://oliviergoy.dev/Images/NinaCarducci/TwoNinaCarducci.webp", "https://oliviergoy.dev/Images/NinaCarducci/ThreeNinaCarducci.webp"],
    "linkGitHub": "https://github.com/olivier-goy/nina-carducci.github.io/tree/optimization",
    "linkWebSite": "https://olivier-goy.github.io/nina-carducci.github.io/",
    "tools": ["LIGHTHOUSE", "WAVE", "GIT", "GITHUB", "VSCODE", "SCHEMA.ORG"]
  },
  {
    "id": "4",
    "title": "KASA",
    "descriptionBackground": "Projet d'étude dans le cadre de ma formation OpenClassrooms.",
    "descriptionRealization": "Réalisation de la partie frontend du site d'une agence de location immobilière avec le framework ReactJS et avec la dépendance React-router. Le site comprend plusieurs pages et composants qui, pour certains, ont été réutilisés à différents endroits du site. Une maquette figma était fournie pour le design des écrans desktop et mobile",
    "descriptionProblematic": "Création du frontend avec le framework ReactJS, seulement une seule dépendance qui est React-Router, et des données fournies dans un fichier au format JSON",
    "descriptionSolution": "Utilisation de react-router pour les routes entre les différentes pages, création de différents composants pour les élements présents sur plusieurs pages ou qui se répètent sur la même page, utilisation des hooks useState pour changer les états comme le carousel et useEffect pour utiliser la méthode les fetchs",
    "imageUrl": "https://oliviergoy.dev/Images/Kasa/Kasa.webp",
    "imagesUrl": ["https://oliviergoy.dev/Images/Kasa/OneKasa.webp", "https://oliviergoy.dev/Images/Kasa/TwoKasa.webp", "https://oliviergoy.dev/Images/Kasa/ThreeKasa.webp", "https://oliviergoy.dev/Images/Kasa/FourKasa.webp", "https://oliviergoy.dev/Images/Kasa/FiveKasa.webp", "https://oliviergoy.dev/Images/Kasa/SixKasa.webp"],
    "linkGitHub": "https://github.com/olivier-goy/Kasa",
    "linkWebSite": "https://kasa-three-phi.vercel.app/",
    "tools": ["REACT", "REACT-ROUTER", "FIGMA", "VSCODE" ]
  },
  {
    "id": "5",
    "title": "MON VIEUX GRIMOIRE",
    "descriptionBackground": "Projet d'étude dans le cadre de ma formation OpenClassrooms.",
    "descriptionRealization": "Création du Backend pour un site de notation de livres en utilisant NodeJs pour le serveur, le framework ExpressJs pour la logique métier et les méthodes de requête, et MongooseJs pour la liaison entre la base de données MongoDB et le Backend. Les requêtes étaient la création et la connexion d'utilisateurs mais aussi l'ajout, la modification et la suppression de livres ainsi que la possibilité de récupérer les livres présents dans la base de données.",
    "descriptionProblematic": "Réalisation d'un backend pour permettre la création et la connexion d'utilisateur, la posibiliter de noter, créer, modifier, supprimer un livre présent en base de données.",
    "descriptionSolution": "Utilisation de l'environement NodeJs pour le serveur, d'ExpressJs comme framework pour les middlewares et la logique métier des requétes, de MongooseJS pour la connexion avec la base de données et de MongoDB pour la base de données. La sécurisation pendant la création d'un compte est gérée avec Bcrypt pour le hachage du mot de passe en base de données et JWT pour la création d'un jeton token pour la sécurisation à la connexion. La librairie SharpMulter est utilisée pour gérer les images en base de données, modifier leur taille et leur format pour la partie optimisation, ainsi que leur emplacement.",
    "imageUrl": "https://oliviergoy.dev/Images/MonVieuxGrimoire/MonVieuxGrimoire.webp",
    "imagesUrl": [ "https://oliviergoy.dev/Images/MonVieuxGrimoire/MonVieuxGrimoire.webp"],
    "linkGitHub": "https://github.com/olivier-goy/Mon-vieux-grimoire/tree/master",
    "linkWebSite": "",
    "tools": ["NODEJS", "EXPRESSJS", "MONGOOSEJS", "JSON", "BCRYPT", "MULTER"]
  },
  {
    "id": "6",
    "title": "MON PORTFOLIO",
    "descriptionBackground": "Projet d'étude dans le cadre de ma formation OpenClassrooms.",
    "descriptionRealization": "Réalisation d'un portfolio pour me rendre plus visible auprès des recruteurs. J'ai réalisé moi-même la maquette sur Figma pour déterminer le design que je souhaitais. J'ai pris la décision de réaliser mon portfolio avec le framework Frontend ReactJS. J'ai créé mon nom de domaine ainsi que mon adresse mail professionnelle sur OVH. J'ai choisi Vercel comme hébergeur de mon portfolio.",
    "descriptionProblematic": "Réalisation de mon portfolio de développeur avec libre choix du design et des technologies utilisées",
    "descriptionSolution": "Figma pour la partie maquette et design. ReactJS pour le framework frontend avec react-router, et la librairie react-modal pour la modal des réalisations. Création de plusieurs données au format JSON qui permettent de faire des requêtes et d'éviter la répétition de code.",
    "imageUrl": "https://oliviergoy.dev/Images/MonPortfolio/portfolio.webp",
    "imagesUrl": ["https://oliviergoy.dev/Images/MonPortfolio/portfolio.webp"],
    "linkGitHub": "https://github.com/olivier-goy/olivier-goy-portfolio",
    "linkWebSite": "",
    "tools": ["REACT", "JAVASCRIPT", "FIGMA", "GIT", "GITHUB", "VERCEL"]
  }
]
